vt-harness/mutations/08-mouse-tracking-inverted.patch
--- a/src/terminal/c/terminal.zig
+++ b/src/terminal/c/terminal.zig
@@ -850,10 +850,10 @@
         .kitty_keyboard_flags => out.* = @as(u8, t.screens.active.kitty_keyboard.current().int()),
         .scrollbar => out.* = t.screens.active.pages.scrollbar().cval(),
         .cursor_style => out.* = .fromStyle(t.screens.active.cursor.style),
-        .mouse_tracking => out.* = t.modes.get(.mouse_event_x10) or
+        .mouse_tracking => out.* = !(t.modes.get(.mouse_event_x10) or
             t.modes.get(.mouse_event_normal) or
             t.modes.get(.mouse_event_button) or
-            t.modes.get(.mouse_event_any),
+            t.modes.get(.mouse_event_any)),
         .title => {
             const title = t.getTitle() orelse "";
             out.* = .{ .ptr = title.ptr, .len = title.len };
