vt-harness/mutations/12-mode-query-inverted.patch
--- a/src/terminal/c/terminal.zig
+++ b/src/terminal/c/terminal.zig
@@ -699,1 +699,1 @@
-    out_value.* = t.modes.get(mode);
+    out_value.* = !t.modes.get(mode);
