vt-harness/mutations/13-erase-complete-short.patch
--- a/src/terminal/Terminal.zig
+++ b/src/terminal/Terminal.zig
@@ -3100,1 +3100,1 @@
-        .complete => .{ 0, self.cols },
+        .complete => .{ 0, self.cols - 1 },
