vt-harness/mutations/14-erase-right-short.patch
--- a/src/terminal/Terminal.zig
+++ b/src/terminal/Terminal.zig
@@ -3084,1 +3084,1 @@
-            break :right .{ x, self.cols };
+            break :right .{ x, self.cols - 1 };
